# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

sheet = ['Привет', 10, 20, 'Пока']

for index in sheet:
    print(index, end=' ')
    print(type(index))
